; domain
;; Alexander Shleyfman (shleyfman.alexander@gmail.com) and Ryo Kuroiwa (mhgeoe@gmail.com)
(define (domain delivery)
    (:types
        room item arm bot - object
    )
    (:predicates
        (at-bot ?b - bot ?x - room)
        (at ?i - item ?x - room)
        (door ?x - room ?y - room)
        (free ?a - arm)
        (in-arm ?i - item ?a - arm)
        (in-tray ?i - item ?b - bot)
        (mount ?a - arm ?b - bot)
    )

    (:functions
        (load_limit ?b - bot)
        (current_load ?b - bot)
        (weight ?i - item)
        (cost)
    )

    (:action move
        :parameters (?b - bot ?x - room ?y - room)
        :precondition (and (at-bot ?b ?x)
            (door ?x ?y))
        :effect (and (at-bot ?b ?y)
            (not (at-bot ?b ?x))
            (increase (cost) 3)
        )
    )

    (:action pick
        :parameters (?i - item ?x - room ?a - arm ?b - bot)
        :precondition (and (at ?i ?x) (at-bot ?b ?x) (free ?a) (mount ?a ?b)
            (<= (+ (current_load ?b) (weight ?i)) (load_limit ?b)))
        :effect (and (in-arm ?i ?a)
            (not (at ?i ?x))
            (not (free ?a))
            (increase (current_load ?b) (weight ?i))
            (increase (cost) 2)
        )
    )

    (:action drop
        :parameters (?i - item ?x - room ?a - arm ?b - bot)
        :precondition (and (in-arm ?i ?a)
            (at-bot ?b ?x)
            (mount ?a ?b))
        :effect (and (free ?a)
            (at ?i ?x)
            (not (in-arm ?i ?a))
            (decrease (current_load ?b) (weight ?i))
            (increase (cost) 2)
        )
    )

    (:action to-tray
        :parameters (?i - item ?a - arm ?b - bot)
        :precondition (and (in-arm ?i ?a)
            (mount ?a ?b))
        :effect (and (free ?a)
            (not (in-arm ?i ?a))
            (in-tray ?i ?b)
            (increase (cost) 1)
        )
    )

    (:action from-tray
        :parameters (?i - item ?a - arm ?b - bot)
        :precondition (and (in-tray ?i ?b)
            (mount ?a ?b)
            (free ?a))
        :effect (and (not (free ?a))
            (in-arm ?i ?a)
            (not (in-tray ?i ?b))
            (increase (cost) 1)
        )
    )
)

; problem
(define (problem delivery-x-5)
   (:domain delivery)
   (:objects rooma roomb roomc - room
             item12 item11 item10
             item9 item8 item7 item6 item5 item4 item3 item2 item1 - item
             bot1 bot2 - bot
             left1 right1 left2 right2 - arm)
   (:init (= (weight item12) 2)
          (= (weight item11) 2)
          (= (weight item10) 1)
          (= (weight item9) 1)
          (= (weight item8) 1)
          (= (weight item7) 1)
          (= (weight item6) 2)
          (= (weight item5) 2)
          (= (weight item4) 1)
          (= (weight item3) 1)
          (= (weight item2) 1)
          (= (weight item1) 1)

          (at item12 rooma)
          (at item11 rooma)
          (at item10 rooma)
          (at item9 rooma)
          (at item8 rooma)
          (at item7 rooma)
          (at item6 rooma)
          (at item5 rooma)
          (at item4 rooma)
          (at item3 rooma)
          (at item2 rooma)
          (at item1 rooma)

          (at-bot bot1 rooma)
          (at-bot bot2 rooma)
          (free left1)
          (free right1)
          (free left2)
          (free right2)
          (mount left1 bot1)
          (mount right1 bot1)
          (mount left2 bot2)
          (mount right2 bot2)

          (door rooma roomb)
          (door roomb rooma)
          (door rooma roomc)
          (door roomc rooma)

          (= (current_load bot1) 0)
          (= (load_limit bot1) 4)
          (= (current_load bot2) 0)
          (= (load_limit bot2) 4)
          (= (cost) 0)
          )
   (:goal (and (at item12 roomb)
               (at item11 roomb)
               (at item10 roomb)
               (at item9 roomb)
               (at item8 roomb)
               (at item7 roomb)
               (at item6 roomc)
               (at item5 roomc)
               (at item4 roomc)
               (at item3 roomc)
               (at item2 roomc)
               (at item1 roomc)))

               (:metric minimize (cost))

)

; plan
1. (pick item4 rooma right2 bot2)
   deleted: (at item4 rooma) (free right2)
   added: (in-arm item4 right2)
   changed: (current_load bot2) from 0 to 1, (cost) from 0 to 2
   goals met: 0 of 12
2. (move bot2 rooma roomc)
   deleted: (at-bot bot2 rooma)
   added: (at-bot bot2 roomc)
   changed: (cost) from 2 to 5
   goals met: 0 of 12
3. (pick item3 rooma left1 bot1)
   deleted: (at item3 rooma) (free left1)
   added: (in-arm item3 left1)
   changed: (current_load bot1) from 0 to 1, (cost) from 5 to 7
   goals met: 0 of 12
4. (drop item4 roomc right2 bot2)
   deleted: (in-arm item4 right2)
   added: (free right2) (at item4 roomc)
   changed: (current_load bot2) from 1 to 0, (cost) from 7 to 9
   goals met: 1 of 12
5. (move bot2 roomc rooma)
   deleted: (at-bot bot2 roomc)
   added: (at-bot bot2 rooma)
   changed: (cost) from 9 to 12
   goals met: 1 of 12
6. (move bot1 rooma roomc)
   deleted: (at-bot bot1 rooma)
   added: (at-bot bot1 roomc)
   changed: (cost) from 12 to 15
   goals met: 1 of 12
7. (pick item5 rooma right2 bot2)
   deleted: (at item5 rooma) (free right2)
   added: (in-arm item5 right2)
   changed: (current_load bot2) from 0 to 2, (cost) from 15 to 17
   goals met: 1 of 12
8. (drop item3 roomc left1 bot1)
   deleted: (in-arm item3 left1)
   added: (free left1) (at item3 roomc)
   changed: (current_load bot1) from 1 to 0, (cost) from 17 to 19
   goals met: 2 of 12
9. (move bot1 roomc rooma)
   deleted: (at-bot bot1 roomc)
   added: (at-bot bot1 rooma)
   changed: (cost) from 19 to 22
   goals met: 2 of 12
10. (move bot2 rooma roomc)
   deleted: (at-bot bot2 rooma)
   added: (at-bot bot2 roomc)
   changed: (cost) from 22 to 25
   goals met: 2 of 12
11. (pick item2 rooma left1 bot1)
   deleted: (at item2 rooma) (free left1)
   added: (in-arm item2 left1)
   changed: (current_load bot1) from 0 to 1, (cost) from 25 to 27
   goals met: 2 of 12
12. (drop item5 roomc right2 bot2)
   deleted: (in-arm item5 right2)
   added: (free right2) (at item5 roomc)
   changed: (current_load bot2) from 2 to 0, (cost) from 27 to 29
   goals met: 3 of 12
13. (move bot2 roomc rooma)
   deleted: (at-bot bot2 roomc)
   added: (at-bot bot2 rooma)
   changed: (cost) from 29 to 32
   goals met: 3 of 12
14. (move bot1 rooma roomc)
   deleted: (at-bot bot1 rooma)
   added: (at-bot bot1 roomc)
   changed: (cost) from 32 to 35
   goals met: 3 of 12
15. (pick item6 rooma right2 bot2)
   deleted: (at item6 rooma) (free right2)
   added: (in-arm item6 right2)
   changed: (current_load bot2) from 0 to 2, (cost) from 35 to 37
   goals met: 3 of 12
16. (drop item2 roomc left1 bot1)
   deleted: (in-arm item2 left1)
   added: (free left1) (at item2 roomc)
   changed: (current_load bot1) from 1 to 0, (cost) from 37 to 39
   goals met: 4 of 12
17. (move bot1 roomc rooma)
   deleted: (at-bot bot1 roomc)
   added: (at-bot bot1 rooma)
   changed: (cost) from 39 to 42
   goals met: 4 of 12
18. (move bot2 rooma roomc)
   deleted: (at-bot bot2 rooma)
   added: (at-bot bot2 roomc)
   changed: (cost) from 42 to 45
   goals met: 4 of 12
19. (pick item1 rooma left1 bot1)
   deleted: (at item1 rooma) (free left1)
   added: (in-arm item1 left1)
   changed: (current_load bot1) from 0 to 1, (cost) from 45 to 47
   goals met: 4 of 12
20. (drop item6 roomc right2 bot2)
   deleted: (in-arm item6 right2)
   added: (free right2) (at item6 roomc)
   changed: (current_load bot2) from 2 to 0, (cost) from 47 to 49
   goals met: 5 of 12
21. (move bot2 roomc rooma)
   deleted: (at-bot bot2 roomc)
   added: (at-bot bot2 rooma)
   changed: (cost) from 49 to 52
   goals met: 5 of 12
22. (move bot1 rooma roomc)
   deleted: (at-bot bot1 rooma)
   added: (at-bot bot1 roomc)
   changed: (cost) from 52 to 55
   goals met: 5 of 12
23. (pick item7 rooma right2 bot2)
   deleted: (at item7 rooma) (free right2)
   added: (in-arm item7 right2)
   changed: (current_load bot2) from 0 to 1, (cost) from 55 to 57
   goals met: 5 of 12
24. (move bot2 rooma roomb)
   deleted: (at-bot bot2 rooma)
   added: (at-bot bot2 roomb)
   changed: (cost) from 57 to 60
   goals met: 5 of 12
25. (drop item7 roomb right2 bot2)
   deleted: (in-arm item7 right2)
   added: (free right2) (at item7 roomb)
   changed: (current_load bot2) from 1 to 0, (cost) from 60 to 62
   goals met: 6 of 12
26. (drop item1 roomc left1 bot1)
   deleted: (in-arm item1 left1)
   added: (free left1) (at item1 roomc)
   changed: (current_load bot1) from 1 to 0, (cost) from 62 to 64
   goals met: 7 of 12
27. (move bot2 roomb rooma)
   deleted: (at-bot bot2 roomb)
   added: (at-bot bot2 rooma)
   changed: (cost) from 64 to 67
   goals met: 7 of 12
28. (pick item8 rooma right2 bot2)
   deleted: (at item8 rooma) (free right2)
   added: (in-arm item8 right2)
   changed: (current_load bot2) from 0 to 1, (cost) from 67 to 69
   goals met: 7 of 12
29. (move bot2 rooma roomb)
   deleted: (at-bot bot2 rooma)
   added: (at-bot bot2 roomb)
   changed: (cost) from 69 to 72
   goals met: 7 of 12
30. (drop item8 roomb right2 bot2)
   deleted: (in-arm item8 right2)
   added: (free right2) (at item8 roomb)
   changed: (current_load bot2) from 1 to 0, (cost) from 72 to 74
   goals met: 8 of 12
31. (move bot2 roomb rooma)
   deleted: (at-bot bot2 roomb)
   added: (at-bot bot2 rooma)
   changed: (cost) from 74 to 77
   goals met: 8 of 12
32. (pick item9 rooma right2 bot2)
   deleted: (at item9 rooma) (free right2)
   added: (in-arm item9 right2)
   changed: (current_load bot2) from 0 to 1, (cost) from 77 to 79
   goals met: 8 of 12
33. (move bot2 rooma roomb)
   deleted: (at-bot bot2 rooma)
   added: (at-bot bot2 roomb)
   changed: (cost) from 79 to 82
   goals met: 8 of 12
34. (drop item9 roomb right2 bot2)
   deleted: (in-arm item9 right2)
   added: (free right2) (at item9 roomb)
   changed: (current_load bot2) from 1 to 0, (cost) from 82 to 84
   goals met: 9 of 12
35. (move bot2 roomb rooma)
   deleted: (at-bot bot2 roomb)
   added: (at-bot bot2 rooma)
   changed: (cost) from 84 to 87
   goals met: 9 of 12
36. (pick item10 rooma right2 bot2)
   deleted: (at item10 rooma) (free right2)
   added: (in-arm item10 right2)
   changed: (current_load bot2) from 0 to 1, (cost) from 87 to 89
   goals met: 9 of 12
37. (move bot2 rooma roomb)
   deleted: (at-bot bot2 rooma)
   added: (at-bot bot2 roomb)
   changed: (cost) from 89 to 92
   goals met: 9 of 12
38. (drop item10 roomb right2 bot2)
   deleted: (in-arm item10 right2)
   added: (free right2) (at item10 roomb)
   changed: (current_load bot2) from 1 to 0, (cost) from 92 to 94
   goals met: 10 of 12
39. (move bot2 roomb rooma)
   deleted: (at-bot bot2 roomb)
   added: (at-bot bot2 rooma)
   changed: (cost) from 94 to 97
   goals met: 10 of 12
40. (pick item11 rooma right2 bot2)
   deleted: (at item11 rooma) (free right2)
   added: (in-arm item11 right2)
   changed: (current_load bot2) from 0 to 2, (cost) from 97 to 99
   goals met: 10 of 12
41. (move bot2 rooma roomb)
   deleted: (at-bot bot2 rooma)
   added: (at-bot bot2 roomb)
   changed: (cost) from 99 to 102
   goals met: 10 of 12
42. (drop item11 roomb right2 bot2)
   deleted: (in-arm item11 right2)
   added: (free right2) (at item11 roomb)
   changed: (current_load bot2) from 2 to 0, (cost) from 102 to 104
   goals met: 11 of 12
43. (move bot2 roomb rooma)
   deleted: (at-bot bot2 roomb)
   added: (at-bot bot2 rooma)
   changed: (cost) from 104 to 107
   goals met: 11 of 12
44. (pick item12 rooma right2 bot2)
   deleted: (at item12 rooma) (free right2)
   added: (in-arm item12 right2)
   changed: (current_load bot2) from 0 to 2, (cost) from 107 to 109
   goals met: 11 of 12
45. (move bot2 rooma roomb)
   deleted: (at-bot bot2 rooma)
   added: (at-bot bot2 roomb)
   changed: (cost) from 109 to 112
   goals met: 11 of 12
46. (drop item12 roomb right2 bot2)
   deleted: (in-arm item12 right2)
   added: (free right2) (at item12 roomb)
   changed: (current_load bot2) from 2 to 0, (cost) from 112 to 114
   goals met: 12 of 12
